# ShowElements Method (ElementSet)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIDocument..::..ShowElements Method (ElementSet)
UIDocument Class See Also
---
Shows the elements by zoom to fit.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ShowElements(
	ElementSet elements
)
```

Visual Basic
---
```text
Public Sub ShowElements ( _
	elements As ElementSet _
)
```

Visual C++
---
```text
public:
void ShowElements(
	ElementSet^ elements
)
```

# ### Parameters
elements
    Type: Autodesk.Revit.DB..::..ElementSetThe set of elements that will be shown.
# Remarks
Places all the elements on the screen by moving the view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Elements is null. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Member of elements is null. |

# See Also
UIDocument Class
ShowElements Overload
Autodesk.Revit.UI Namespace